docs/prim.html
<!doctype html>
<html lang="en">
<head>
<title>Algoritmo di Prim</title>
<!-- 2022-05-08 Sun 12:23 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Pietro Visconti">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Specifiche preliminari</a></li>
<li><a href="#sec-2">2. Algoritmo di Prim</a></li>
<li><a href="#sec-3">3. Complessità</a></li>
<li><a href="#sec-4">4. Dimostrazione della correttezza</a></li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title">Algoritmo di Prim</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Specifiche preliminari</h2>
<div class="outline-text-2" id="text-1">
<blockquote>
<p>
<b>∀ u ∈ V</b>:
<br>
</p>
<ol class="org-ol">
<li>key[u] corrisponde al <b>peso dell&rsquo;arco</b> che collega all&rsquo;altra parte del taglio.
</li>
<li>π[u] al <b>nodo predecessore</b> (ossia quello collegato dall&rsquo;altra parte del taglio).
</li>
<li>Q è sottoinsieme di V[G] e rappresenta una coda di priorità contenente i <b>vertici da estrarre</b>.
</li>
<li>Di conseguenza l&rsquo;insieme V-Q rappresenta i <b>vertici già estratti</b>.
</li>
</ol>
</blockquote>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Algoritmo di Prim</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #a89984;">/*</span>
<span style="color: #a89984;">G = grafo</span>
<span style="color: #a89984;">w = funzione peso</span>
<span style="color: #a89984;">r = radice</span>
<span style="color: #a89984;">*/</span>
<span style="color: #8f3f71;">MST</span>-<span style="color: #8f3f71;">PRIM</span><span style="color: #076678;">(</span>G, w, r<span style="color: #076678;">){</span>
    <span style="color: #a89984;">//</span><span style="color: #a89984;">INIZIALIZZAZIONE</span>
    Q &lt;- V<span style="color: #b16286;">[</span>G<span style="color: #b16286;">]</span>
    <span style="color: #9d0006;">for</span> each u in Q<span style="color: #b16286;">{</span>
        key<span style="color: #8ec07c;">[</span>u<span style="color: #8ec07c;">]</span> &lt;- +inf
        &#960;<span style="color: #8ec07c;">[</span>u<span style="color: #8ec07c;">]</span> &lt;- <span style="color: #8f3f71;">NIL</span>
    <span style="color: #b16286;">}</span>
    key<span style="color: #b16286;">[</span>r<span style="color: #b16286;">]</span> &lt;- <span style="color: #8f3f71; font-weight: bold;">0</span>

    <span style="color: #a89984;">//</span><span style="color: #a89984;">CORPO DELL'ALGORITMO</span>
    <span style="color: #9d0006;">while</span><span style="color: #b16286;">(</span>Q != <span style="color: #8f3f71;">NIL</span><span style="color: #b16286;">){</span>
        u &lt;- <span style="color: #8f3f71;">EXTRACT_MIN</span><span style="color: #8ec07c;">(</span>Q<span style="color: #8ec07c;">)</span>

        <span style="color: #a89984;">//</span><span style="color: #a89984;">PER OGNI VERTICE ADIACENTE A u</span>
        <span style="color: #9d0006;">for</span> each v in <span style="color: #8f3f71;">ADJ</span><span style="color: #8ec07c;">[</span>u<span style="color: #8ec07c;">]{</span>
            <span style="color: #9d0006;">if</span><span style="color: #d65d0e;">(</span>v &#8712; Q <span style="color: #9d0006;">and</span> w<span style="color: #076678;">(</span>u, v<span style="color: #076678;">)</span> &lt; key<span style="color: #076678;">[</span>v<span style="color: #076678;">]</span><span style="color: #d65d0e;">){</span>
                &#960;<span style="color: #076678;">[</span>v<span style="color: #076678;">]</span> &lt;- u
                key<span style="color: #076678;">[</span>v<span style="color: #076678;">]</span> &lt;- w<span style="color: #076678;">(</span>u, v<span style="color: #076678;">)</span>
            <span style="color: #d65d0e;">}</span>
        <span style="color: #8ec07c;">}</span>
    <span style="color: #b16286;">}</span>

    <span style="color: #9d0006;">return</span> A &lt;- <span style="color: #b16286;">{</span><span style="color: #8ec07c;">(</span>u, &#960;<span style="color: #d65d0e;">[</span>u<span style="color: #d65d0e;">]</span><span style="color: #8ec07c;">)</span> &#8712; E | u &#8712; V - <span style="color: #8ec07c;">{</span>r<span style="color: #8ec07c;">}</span><span style="color: #b16286;">}</span>
<span style="color: #076678;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Complessità</h2>
<div class="outline-text-2" id="text-3">
<blockquote>
<p>
n (inizializzazione) + nlogn (estrazione da Q) + 2mlogn (ciclo for + funzione peso)
<br>
= O(n + nlogn + mlogn) -&gt; <font color="red"> O(mlogn)</font>
</p>
</blockquote>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Dimostrazione della correttezza</h2>
<div class="outline-text-2" id="text-4">
<blockquote>
<p>
L&rsquo;algoritmo di Prim è corretto grazie al <a href="kruskal.html">teorema fondamentale degli MST</a>
</p>
</blockquote>
</div>
</div>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: Pietro Visconti</p>
<p class="date">Created: 2022-05-08 Sun 12:23</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 28.0.91 (<a href="http://orgmode.org">Org-mode</a> 9.6)</p>
</div>
</footer>
</body>
</html>
